Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoints Method (Picker.PickPointEnum, String)
 Queries the user to pick points from the model with the given prompt and reference to another point.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList PickPoints(
	Picker.PickPointEnum Enum,
	string Prompt
)
Public Function PickPoints (
	Enum As Picker.PickPointEnum,
	Prompt As String
) As ArrayList
Parameters
Enum
Type: Tekla.Structures.Model.UI.Picker.PickPointEnum
Indicates how many points the user must pick.
Prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: ArrayList
A list of points the user picked.
See Also
Reference
Picker Class
PickPoints Overload
Tekla.Structures.Model.UI Namespace